<?php
require_once __DIR__ . '/error-config.php';

echo "<pre>";
$read = 0b001;
$write = 0b010;
$change = 0b100;

$userId_1 = 0b000;

echo ($userId_1 & $read) ? "Пользователь имеет право на чтение<br>" : "Пользователь не имеет право на чтение<br>";
echo ($userId_1 & $write) ? "Пользователь имеет право на запись<br>" : "Пользователь не имеет право на запись<br>";
echo ($userId_1 & $change) ? "Пользователь имеет право на изменение<br>" : "Пользователь не имеет право на изменение<br>";

echo "</pre>";